{
  "addons": [
    {
      "datei": "testverzeichniss.sh",
      "beschreibung": "Mit der Funktion kann man überprüfen, ob das Addon-Verzeichnis richtig erstellt wurde.",
      "version": "1.5",
      "autor": "Ebner Stephan"
    },
    {
      "datei": "sdcheck.sh",
      "beschreibung": "Mit der Funktion kann man überprüfen, ob ein SD Karten Fehler vorliegt",
      "version": "1.5",
      "autor": "Ebner Stephan"
    },
    {
      "datei": "healthcheck.sh",
      "beschreibung": "Zeigt CPU-Last, RAM-Auslastung, SD-Kartenspeicherplatz & Temperatur und vieles mehr",
      "version": "2.0",
      "autor": "Ebner Stephan"
    },
    {
      "datei": "updateSystem.sh",
      "beschreibung": "Mit dieser Funktion wird ein Update des Betriebssystems durchgeführt. Wichtig: Je nach Alter des Systems kann der Vorgang mehrere Minuten dauern. Bitte darauf achten, dass im Dialogfeld die Meldung Installation abgeschlossen erscheint, bevor Sie den Vorgang beenden. Das Update hat keinen Einfluss auf die Flugbuch-Software.",
      "version": "1.0",
      "autor": "Ebner Stephan"
    },
    {
      "datei": "WireGuardClient.sh",
      "beschreibung": "Installiert und konfiguriert den WireGuard Client für eine sichere VPN-Verbindung.Nach erfolgreicher Installation wird auf der Startseite ein zusätzliches Button angezeigt, über das die Konfiguration vorgenommen werden kann.Wichtig: Je nach Alter des Systems kann der Vorgang mehrere Minuten dauern. Bitte darauf achten, dass im Dialogfeld die Meldung Installation abgeschlossen erscheint, bevor Sie den Vorgang beenden.",
      "version": "1.0",
      "autor": "Ebner Stephan"
    },
    {
      "datei": "uninstall_wireguard.sh",
      "beschreibung": "Deinstalliert den WireGuard Client vollständig, entfernt alle zugehörigen Dateien, Dienste und Berechtigungen und löscht sich anschließend selbst.",
      "version": "1.0",
      "autor": "Ebner Stephan"
    },
    {
      "datei": "FlugbuchViewer.sh",
      "beschreibung": "Richtet einen Kiosk-Modus für den Flugbuch-Viewer auf Raspberry Pi 3 oder neuer ein (nicht für Zero/Zero 2!). Automatischer Start des Browsers im Vollbild, Web-UI zur bequemen Änderung der Kiosk-URL, Watchdog für Neustart bei Fehlern. Der interne HDMI-Anschluss kann für einen externen Bildschirm genutzt werden, um die aktuell angemeldeten Piloten anzuzeigen.",
      "version": "1.0",
      "autor": "Ebner Stephan"
    },
    {
      "datei": "safeBoot.sh",
      "beschreibung": "Installiert ein Selbstheilungs-System für Raspberry Pi (alle Modelle, inkl. Zero 2 W): erkennt defekte Boots mit Dienst-Check (dbus/journald/NetworkManager), stellt automatisch gesicherte Standard-Konfigurationen wieder her und startet betroffene Dienste neu. Bei gesundem Boot werden laufende/aktivierte Dienste erkannt und ihre wichtigsten Configs sowie Unit-Overrides versioniert gesichert. Inklusive zRAM-Swap (dphys-swapfile aus), geplantem fsck für die SD-Root-Partition, eigenem Log mit Logrotation (/var/log/safe-boot.log) und Safe-Mode-Flag auf /boot. Zusätzlicher Speicherplatz mit 500MB",
      "version": "1.0",
      "autor": "Ebner Stephan"
    },
    {
      "datei": "Pi4_System_Anpassungen.sh",
      "beschreibung": "Dieses Add-on muss zwingend installiert werden, wenn ein Raspberry Pi 4 verwendet wird.Es passt das Basic-Image an die Betriebsumgebung des Pi 4 an und aktiviert bzw. ändert Funktionen, die auf dem Pi Zero 2 W noch nicht vorhanden waren.",
      "version": "1.0",
      "autor": "Ebner Stephan"
    },
    {
      "datei": "Pi3_System_Anpassungen.sh",
      "beschreibung": "Dieses Add-on muss zwingend installiert werden, wenn ein Raspberry Pi 3 verwendet wird.Es passt das Basic-Image an die Betriebsumgebung des Pi 3 an und aktiviert bzw. ändert Funktionen, die auf dem Pi Zero 2 W noch nicht vorhanden waren.",
      "version": "1.0",
      "autor": "Ebner Stephan"
    },
    {
      "datei": "Support_Help.sh",
      "beschreibung": "Mit dem Add-on kann der Support den Anwender bei Problemen oder anderen Anliegen aus der Ferne unterstützen.Dazu muss zuvor lediglich die eindeutige ID des installierten Systems an den Support übermittelt werden.Nach erfolgreicher Bestätigung kann das Add-on anschließend installiert werden.",
      "version": "1.0",
      "autor": "Ebner Stephan"
    }
  ]
}














